import * as Yup from "yup";

const registerSchema = Yup.object().shape({
  name: Yup.string().required("لطفا نام خود را وارد کنید.").min(3 , "نام حداقل باید 3 حروف باشد.").max(15, "نام حداکثر باید 15 حروف باشد."),
  email: Yup.string().required("لطفا ایمیل خود را وارد کنید.").email("ایمیل خود را درست وارد کنید.").min(13 , "ایمیل حداقل باید 13 حروف باشد.").max(30 , "ایمیل حداکثر باید 30 حروف باشد."),
  username : Yup.string().required("لطفا نام کاربری خود را وارد کنید.").matches(/^\w+$/ , "نام کاربری خود فقط شامل اعداد و حروف انگلیسی میباشد.").min(8 , "نام کاربری حداقل باید 8 حروف باشد.").max(24, "نام کاربری حداکثر باید 24 حروف باشد."),
  phone:Yup.string().required("لطفا شماره همراه خود را وارد کنید.").matches(/^09\d{9}$/ , "(09123456789)لطفا شماره همراه خود را درست وارد کنید"),
  password:Yup.string().required("لطفا رمزعبور خود را وارد کنید").matches(/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d]{8,24}$/ , "حداقل 8 کاراکتر و حداکثر 24 کاراکتر، حداقل یک حرف و یک عدد"),
  confirmPassword:Yup.string().required("لطفا تایید رمزعبور خود را وارد کنید").matches(/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d]{8,24}$/ , "حداقل 8 کاراکتر و حداکثر 24 کاراکتر، حداقل یک حرف و یک عدد")
});

export default registerSchema;
